{
  "credits": 2338,
  "server_timestamp": "2025-01-07 18:37:26.693318+00:00",
  "data": {
    "AAPL": [
      {
        "timestamp": "2024-01-01T23:59:39",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://traderscommunity.com/traders-market-weekly-brand-new-year-what-is-ahead/",
        "title": "Traders Market Weekly: Brand New Year, what is Ahead?",
        "summary": "The Santa rally marched on with all three major US Indices closing 2023.The Nasdaq and Dow Jones both notched all-time highs in a run that found it's legs back in October.Be wary of the best performing sectors being pumped by analysts and dribblers alike. Geopolitical risk is alive and well.The reality is trade at the market and leave your ego at the door. Welcome 2024 and map out your plan with multipole possibilities and bifurcation in your risk matrix. The size of the traders’ positions means the Fed may have to intervene if they hit trouble again.‘There are only a couple of players and these players have made themselves too big to fail,' says Kathryn Kaminski, chief research strategist at AlphaSimplex Group. Investment-grade corporate spreads to Treasuries traded Friday below 100 bps for the first time since January 2022.High yield CDS sank 35 to 367 bps, the lowest level since April 2022. Bond market reacting to economic data week that continues to look consistent with a soft-landing scenario.The bond market is reacting to.the squeeze dynamics and the new longs present market fragility which is also evident in crowded longs.  Cboe Global Markets show trading volumes in options tied to the Vix are on track to hit a record this year.Over the past five years the VIX has only been at or below a reading of 12 on 25 trading days, of which five came in January 2022 at the start of last year’s bear market, according to DataTrek. Household debt growth slowed from 2.71% to 2.52% during the quarter.For the second straight quarter, federal borrowings completely dominated NFD growth.Treasuries inflated $2.180 TN over the past year, with two-year growth of a staggering $4.399 TN.  Broker/Dealer “Repo’ borrowings surged $326 billion, or 22%, in the five-quarter Q1 2018 through Q2 2019 period, leading up to summer 2019 repo market instability – and the Fed’s resumption of QE.The Credit cycle downturn is coming to the surface.Growth in China's metric of system Credit growth, Aggregate Financing, dropped to $175 billion. Hong Kong’s home prices dropped to the lowest in almost seven years as high interest rates continue to weigh on buyers’ appetite, driving them to rent instead.A sobering thought is the UK is just the initial first world pension system in this cycle facing the harsh reality of a steep devaluation of assets. The S&P 500’s is over the traditional measurement of a new bull market typically measured as a 20% gain from a significant low.That ended the longest bear market since 1948.The DAX and CAC40 have seen all-time highs recently also. Biotech Neuren Pharmaceuticals the best-performing stock, up 214.1% year-to-date.Singapore iron ore futures rallied 1.4% to $US140 ($204.7) a tonne for the January contract Friday.Lithium and nickel producers Core Lithium and IGO were among the worst performers, heading for a 75.6% and 32.8% loss respectively respectively.  Since 1950 there has never been a bear market rally that exceeded the 50% retracement then gone on to make new cycle lows?On the way up each new high evolved after testing Tenkan key support on the way and we are now getting a retest as resistance.Watch Tenkan this week and watch for Kijun reaction. The Vanguard Mega-Cap Growth ETF (MGK) delta is important to watch.A firm rejection at $175 at +2/8 triggered a waterfall down for Apple last year.Key now is the weekly trend it has been in all year. The price of crude oil held steady today, falling $8.67, or 10.8%, for the year The U.S. Dollar Index also ended the session flat, at 101.23, surrendering 2.2% in 2023.The Institute of International Finance (IIF) released their Q1 2023 Global Debt Monitor.  Bank of China holdings of bullion rose by 680,000 troy ounces last month.That’s equivalent to 23 tons.The U.S. dollar is getting some competition in commodities markets.  Bitcoin put in a high of $63,000 around Coinbase, the largest US crypto exchange successfully went public which signaled profit-taking.The high over $68,000 came after the launch over the Bitcoin ETF. From that high we have two main alternatives a V of a 1 of a V – an incredible 26% fall in a Friday night session. U.S. stock markets are closed for the New Year holiday.Monday includes U.S stock markets closed.Investors (and algos) will focus on conference calls and outlooks.The jobs report for December will be released for December.  Monday includes U.S. stock markets are closed for the New Year holiday.The United States jobs report for December will be released.Economists forecast 168K job additions for the month and expect the unemployment rate at 3.8%.",
        "sentiment_spans": [
          {
            "sentiment": "positive",
            "idx": [102, 124]
          },
          {
            "sentiment": "positive",
            "idx": [187, 210]
          },
          {
            "sentiment": "neutral",
            "idx": [270, 292]
          },
          {
            "sentiment": "negative",
            "idx": [294, 347]
          },
          {
            "sentiment": "neutral",
            "idx": [391, 395]
          },
          {
            "sentiment": "negative",
            "idx": [511, 558]
          },
          {
            "sentiment": "negative",
            "idx": [614, 651]
          },
          {
            "sentiment": "negative",
            "idx": [840, 909]
          },
          {
            "sentiment": "neutral",
            "idx": [958, 1016]
          },
          {
            "sentiment": "positive",
            "idx": [1021, 1111]
          },
          {
            "sentiment": "neutral",
            "idx": [1237, 1249]
          },
          {
            "sentiment": "neutral",
            "idx": [1261, 1261]
          },
          {
            "sentiment": "negative",
            "idx": [1470, 1503]
          },
          {
            "sentiment": "neutral",
            "idx": [1565, 1596]
          },
          {
            "sentiment": "neutral",
            "idx": [1609, 1609]
          },
          {
            "sentiment": "neutral",
            "idx": [1707, 1707]
          },
          {
            "sentiment": "negative",
            "idx": [2027, 2034]
          },
          {
            "sentiment": "negative",
            "idx": [2076, 2097]
          },
          {
            "sentiment": "negative",
            "idx": [2241, 2287]
          },
          {
            "sentiment": "neutral",
            "idx": [2361, 2361]
          },
          {
            "sentiment": "negative",
            "idx": [2494, 2523]
          },
          {
            "sentiment": "positive",
            "idx": [2628, 2650]
          },
          {
            "sentiment": "neutral",
            "idx": [2694, 2714]
          },
          {
            "sentiment": "negative",
            "idx": [2825, 2857]
          },
          {
            "sentiment": "neutral",
            "idx": [2920, 2920]
          },
          {
            "sentiment": "positive",
            "idx": [3050, 3111]
          },
          {
            "sentiment": "neutral",
            "idx": [3130, 3154]
          },
          {
            "sentiment": "positive",
            "idx": [3188, 3222]
          },
          {
            "sentiment": "neutral",
            "idx": [3227, 3267]
          },
          {
            "sentiment": "negative",
            "idx": [3324, 3371]
          },
          {
            "sentiment": "neutral",
            "idx": [3387, 3423]
          },
          {
            "sentiment": "positive",
            "idx": [3448, 3466]
          },
          {
            "sentiment": "neutral",
            "idx": [3717, 3721]
          },
          {
            "sentiment": "negative",
            "idx": [3757, 3785]
          },
          {
            "sentiment": "positive",
            "idx": [3803, 3830]
          },
          {
            "sentiment": "neutral",
            "idx": [3855, 3855]
          },
          {
            "sentiment": "positive",
            "idx": [3996, 4013]
          },
          {
            "sentiment": "negative",
            "idx": [4126, 4145]
          },
          {
            "sentiment": "neutral",
            "idx": [4192, 4202]
          },
          {
            "sentiment": "neutral",
            "idx": [4263, 4270]
          },
          {
            "sentiment": "neutral",
            "idx": [4271, 4271]
          },
          {
            "sentiment": "neutral",
            "idx": [4367, 4383]
          },
          {
            "sentiment": "neutral",
            "idx": [4434, 4470]
          },
          {
            "sentiment": "neutral",
            "idx": [4514, 4530]
          },
          {
            "sentiment": "negative",
            "idx": [4600, 4626]
          }
        ],
        "mentions": 3,
        "img_url": "http://traderscommunity.com/wp-content/uploads/2024/01/Trading-Places-Merry-New-year-e1704127464812.png",
        "title_sentiment": "neutral"
      },
      {
        "timestamp": "2024-01-01T23:56:58",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://www.guerillastocktrading.com/apples-vision-pro-headset-vs-meta-the-emerging-battle-for-mixed-reality-dominance/",
        "title": "Apple's Vision Pro Headset vs. Meta: The Emerging Battle for Mixed Reality Dominance",
        "summary": "The tech world is abuzz with anticipation as Apple gears up to launch its Vision Pro headset in early 2024, setting the stage for a potential platform war reminiscent of historic battles like PC vs. Mac vs. Android.The battle could catalyze the growth of mixed reality technology and expand its reach beyond niche markets.",
        "sentiment_spans": [
          {
            "sentiment": "neutral",
            "idx": [0, 0]
          },
          {
            "sentiment": "positive",
            "idx": [227, 301]
          }
        ],
        "mentions": 3,
        "img_url": "https://www.guerillastocktrading.com/wp-content/uploads/2020/01/cropped-cropped-dollars-32x32.png",
        "title_sentiment": "positive"
      },
      {
        "timestamp": "2024-01-01T23:43:12",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://www.blueharbinger.com/free-reports-1/DayofWeek/2023/12/5/top-10-growth-stocks-for-2024-smid-cap-amp-short-sales-revenge-ke6h2-33xfa",
        "title": "Amazon: Ranking “The Magnificent 7” for 2024 — Blue Harbinger Investment Research",
        "summary": "Andy Jassy joined Amazon in 1997, founded the largest cloud service in the world, and became CEO (succeeding Jeff Bezos) in 2021.Jassy’s pay was just $1.3 million in 2022 (tiny for a mega-cap CEO) because, again, it is tied mainly to stock performance (which was terrible in 2022) Nvidia just had an incredible year following the explosion of AI in 2023.N Nvidia is still the cheapest Magnificent 7 stock on a forward PEG basis because its grow is expected to remain so high in the years ahead.Apple has the lowest expected growth rate. Microsoft still has an AAA credit rating with Microsoft Windows, Microsoft Office and Microsoft Azure.Despite recent price gains, it still trades at a reasonable 2.7x forward PEG multiple and 32x forward PE ratio.Apple is the least innovative of the Magnificent 7 (Tim Cook is great, but the company is not the great innovator it once once.",
        "sentiment_spans": [
          {
            "sentiment": "positive",
            "idx": [34, 253]
          },
          {
            "sentiment": "positive",
            "idx": [376, 404]
          },
          {
            "sentiment": "neutral",
            "idx": [501, 536]
          },
          {
            "sentiment": "positive",
            "idx": [554, 578]
          },
          {
            "sentiment": "neutral",
            "idx": [641, 641]
          },
          {
            "sentiment": "negative",
            "idx": [759, 866]
          }
        ],
        "mentions": 7,
        "img_url": "http://static1.squarespace.com/static/53f238bce4b0d0156e18c38a/t/65934a9e253e2018b0c77a1d/1704129962961/AMZN+LOGO.png?format=1500w",
        "title_sentiment": "neutral"
      },
      {
        "timestamp": "2024-01-01T23:26:01",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://finance.yahoo.com/news/buffetts-bullseye-meet-4-stocks-190014097.html",
        "title": "Buffett's Bullseye: Meet The 4 Stocks That Make Up Nearly 75% Of His Portfolio",
        "summary": "Warren Buffett once said, \"If you don’t find a way to make money while you sleep, you will work until you die\"Coca-ColaBuffett generated nearly $704 million in dividends from his investment in the Coca-Cola Co.The Dividend Aristocrat stock has a dividend payout history as it has hiked its annual dividend payouts for 61 consecutive years. Bank of America has benefitted from the decades-high interest rates, as the bank's total net income rose by 10% year over year to $7.8 billion in the fiscal third quarter that ended Sept. 30.American Express reported record third-quarter revenue for the sixth consecutive quarter, up 13% from the same period last year.",
        "sentiment_spans": [
          {
            "sentiment": "positive",
            "idx": [127, 169]
          },
          {
            "sentiment": "positive",
            "idx": [241, 270]
          },
          {
            "sentiment": "positive",
            "idx": [361, 452]
          }
        ],
        "mentions": 4,
        "img_url": "https://media.zenfs.com/en/Benzinga/9437497f5f23cf9f5ff2a59fe31e7bed",
        "title_sentiment": "negative"
      },
      {
        "timestamp": "2024-01-01T22:45:12",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://www.streetinsider.com/Analyst+Comments/3+reasons+why+Apple+stock+could+outperform+again+in+2024+-+Citi/22526501.html",
        "title": "3 reasons why Apple stock could outperform again in 2024 - Citi",
        "summary": "Apple stock has shown remarkable performance this year, surging by 50%, and easily outpacing the S&P 500's 20.I'm a Returning Customer (or username, if registered via mobile device)",
        "sentiment_spans": [
          {
            "sentiment": "positive",
            "idx": [16, 44]
          }
        ],
        "mentions": 1,
        "img_url": "http://www.streetinsider.com/https://www.streetinsider.com/images/summaries/16/resize_AppleREnew_61a8bd17a7a29.jpg",
        "title_sentiment": "positive"
      },
      {
        "timestamp": "2024-01-01T19:44:13",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://wccftech.com/masimo-spent-around-100-million-fighting-apple-patent-violation/amp/",
        "title": "Masimo Has Spent ‘Around $100 Million’ In Its Patent Violation Fight Against Apple; CEO Says He Was Warned, Called Crazy For His Efforts",
        "summary": "The recent Apple Watch sales ban in the U.S. was thanks to the efforts of Masimo, a health technology firm that claims Apple uses stolen technology in its latest smartwatch models.Masimo CEO Joe Kiani says he will not stop until Apple changes the way it deals with smaller companies.",
        "sentiment_spans": [
          {
            "sentiment": "negative",
            "idx": [23, 32]
          },
          {
            "sentiment": "negative",
            "idx": [202, 284]
          }
        ],
        "mentions": 1,
        "img_url": "https://cdn.wccftech.com/wp-content/uploads/2023/12/Joe-Kiani-CEO-of-Masimo.jpg",
        "title_sentiment": "neutral"
      },
      {
        "timestamp": "2024-01-01T19:39:10",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://machash.com/appleinsider/363977/save-up-to-150-apples-ipad-air-new-2024-discounts/?utm_source=dlvr.it&utm_medium=twitter",
        "title": "Save up to $150 on Apple's iPad Air with new 2024 discounts",
        "summary": "It's a content discovery engine that continuously delivers the latest Apple, Mac and iOS headlines from the web's best sources.",
        "sentiment_spans": [
          {
            "sentiment": "neutral",
            "idx": [50, 58]
          }
        ],
        "mentions": 1,
        "img_url": "https://photos5.appleinsider.com/gallery/57891-117905-ipad-air-discount-blue-2024-xl.jpg",
        "title_sentiment": "negative"
      },
      {
        "timestamp": "2024-01-01T19:22:11",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://wallstreetwaves.com/top-5-stocks-to-consider-avoiding-as-we-begin-2024/",
        "title": "Top 5 Stocks To Consider Avoiding As We Begin 2024",
        "summary": "The year gone by marked an unexpected, staggering upswing, compelling stock-pickers to recalibrate their bearings.In the wake of such unanticipated swells, the terrain for the upcoming year demands a cautious approach, tethered to a discerning evaluation of stock prospects.The rationale isn't necessarily to jettison or short these stocks but rather to approach them with circumspection at current levels. With AAPL cloaked in a ‘D’ growth grade, the specter of the iPhone-driven bonanza prolonged isn’t a given.The impending retail foray of its Vision Pro might elevate market sentiment in 2024, yet immediate earnings accretion seems implausible.",
        "sentiment_spans": [
          {
            "sentiment": "positive",
            "idx": [27, 58]
          },
          {
            "sentiment": "negative",
            "idx": [135, 156]
          },
          {
            "sentiment": "neutral",
            "idx": [290, 341]
          },
          {
            "sentiment": "neutral",
            "idx": [409, 409]
          },
          {
            "sentiment": "neutral",
            "idx": [520, 591]
          }
        ],
        "mentions": 13,
        "img_url": "https://wallstreetwaves.com/wp-content/uploads/2024/01/image_1411239127.jpg",
        "title_sentiment": "negative"
      },
      {
        "timestamp": "2024-01-01T18:53:35",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://www.businessinsider.com/apple-serial-number-lookup?utm_source=dlvr.it&utm_medium=twitter",
        "title": "Apple serial number lookup: How to identify your device",
        "summary": "On a Mac computer, you will find the serial number following the word \"Serial\"The serial number will be between 10 and 15 digits long.For newer phones or tablets, your device will be listed as \"iPad\" or as a named device if you assigned it a name. From anywhere on your Mac, click on the Apple logo at the top left of the screen, you will find the serial number following the word \"Serial\"For iPhones and iPads, the serial numbers can physically be found on the back of older devices, instead, open the \"Settings\" app.",
        "sentiment_spans": [
          {
            "sentiment": "negative",
            "idx": [96, 128]
          },
          {
            "sentiment": "neutral",
            "idx": [176, 203]
          },
          {
            "sentiment": "neutral",
            "idx": [311, 484]
          }
        ],
        "mentions": 3,
        "img_url": "https://i.insider.com/658ecb66ec62ab5daf7f7e07?width=1200&format=jpeg",
        "title_sentiment": "neutral"
      },
      {
        "timestamp": "2024-01-01T16:46:58",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://talkmarkets.com/content/us-markets/trading-the-super-seven-recap?post=425093",
        "title": "Trading The Super Seven: Recap",
        "summary": "The Super Seven group consists of Amazon, Meta, Microsoft, Nvidia, Tesla, Alphabet and Apple.It should be noted that the Super Seven recorded a 74% rise in combined value during 2023.  Market analysts have been optimistic about Amazon's performance, with stock forecasts predicting positive outcomes for the company in 2024.The company reported a robust third quarter with a 23% increase in revenue, marking its fastest growth rate since 2021.However, there are concerns over potential future impacts of regulatory fears on the stock.",
        "sentiment_spans": [
          {
            "sentiment": "neutral",
            "idx": [0, 0]
          },
          {
            "sentiment": "positive",
            "idx": [134, 171]
          },
          {
            "sentiment": "neutral",
            "idx": [185, 185]
          }
        ],
        "mentions": 6,
        "img_url": "https://images.unsplash.com/photo-1585829365295-ab7cd400c167?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=1000&q=80",
        "title_sentiment": "neutral"
      }
    ],
    "GOOGL": [
      {
        "timestamp": "2024-01-01T13:34:40",
        "asset_class": "stock",
        "location": "us",
        "original_url": "https://seekingalpha.com/article/4660591-top-5-stocks-to-consider-avoiding-as-we-begin-2024?source=feed_all_articles&utm_source=dlvr.it&utm_medium=twitter",
        "title": "Top 5 Stocks To Consider Avoiding As We Begin 2024",
        "summary": "The S&P 500 (SPX) has outperformed Wall Street strategists' bearish prognostications, finishing the year up 25%.The Magnificent Seven comprises Apple (AAPL), Microsoft (MSFT), Google (GOOGL) and Tesla led with triple-digit YTD gains, notching a return of 115% YTD.  Investors who have not managed to join their rallies in 2023 are urged to consider waiting for more attractive buy levels.I would consider avoiding AAPL, NVDA, and MSFT at the current levels, as their price action aren't constructive.The market could have priced in over-optimism on their prospects, which could cause investors to be disappointed. I've covered Eli Lilly and Novo Nordisk (NVO) recently, explaining why I'm cautious about investors who missed their surge in 2023 to be wary.It's arguable that the market could have priced in over-optimism on their prospects, which could cause investors to be disappointed if they don't execute accordingly.The 2023 winners listed above have outperformed the market and their peers significantly.",
        "sentiment_spans": [
          {
            "sentiment": "negative",
            "idx": [18, 84]
          },
          {
            "sentiment": "positive",
            "idx": [327, 387]
          },
          {
            "sentiment": "neutral",
            "idx": [389, 389]
          },
          {
            "sentiment": "negative",
            "idx": [513, 567]
          },
          {
            "sentiment": "negative",
            "idx": [720, 738]
          },
          {
            "sentiment": "neutral",
            "idx": [759, 759]
          },
          {
            "sentiment": "positive",
            "idx": [956, 984]
          }
        ],
        "mentions": 3,
        "img_url": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1411239127/image_1411239127.jpg?io=getty-c-w1536",
        "title_sentiment": "negative"
      }
    ]
  }
}
